tasks/app/services/tasks/create.rb

INSERT INTO "tasks" ("user_id", "title", "description", "status", "created_at", "updated_at", "assign_price", "finish_price") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def call
      Rails.logger.info "Creating task with params #{task_params}"
      validate_params

      if validation_errors.present?
        Rails.logger.info "Task not created due to invalid params"
        context.fail!(errors: validation_errors.join(', '))
      end

      if task = Task.create(task_params)