tasks/app/services/current_user.rb

SELECT "users".* FROM "users" WHERE "users"."external_id" = $1 LIMIT $2  [["external_id", "f6107ee1-df7c-4d06-823b-cddf43c631d0"], ["LIMIT", 1]]
---
  def call
    context.fail!(errors: 'Invalid token') unless token.present?
    uri = URI("http://auth:3001/jwt/validate")
    req = Net::HTTP::Post.new(uri)
    req.body = { token: token }.to_json
    req.content_type = 'application/json'
    res = Net::HTTP.start(uri.hostname, uri.port) do |http|
      http.request(req)
    end

    context.fail!(errors: 'Invalid token') unless res.code == '200'

    user_id = JSON.parse(res.body)['user_id']
    user = User.find_by(external_id: user_id)