auth/app/services/jwt_decode.rb

  def call
    payload = JWT.decode(token, 'jwt_secret', true, { algorithm: 'HS256' }).first
    context.user = User.find_by(id: payload['user_id'])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", "f6107ee1-df7c-4d06-823b-cddf43c631d0"], ["LIMIT", 1]]